* 
** boot an internal server or connect to an external one?
#+BEGIN_SRC clojure
(use 'overtone.live)
#+END_SRC
 
vs.

#+BEGIN_SRC clojure
(use 'overtone.core)
#+END_SRC

#+BEGIN_SRC clojure
(connect-external-server 57110)
#+END_SRC
** start some where--demo a sin-osc
#+BEGIN_SRC clojure
(demo (sin-osc))
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/audition-synth 33>
** define an inst or define a synth?

#+BEGIN_SRC clojure
   ;;Overtone version    
    (defsynth foo
      (let [src (* (decay (impulse 0.3) 0.1) (white-noise 0.2))
        local (+ (local-in 2) [src 0])
        local (delay-n local 0.2 0.2)
        _ (local-out (* (reverse local) 0.8))]
      (out 0 local)))
#+END_SRC
** Function.play version
#+BEGIN_SRC sclang
{
            var source, local;

            source = Decay.ar(Impulse.ar(0.3), 0.1) * WhiteNoise.ar(0.2);

            local = LocalIn.ar(2) + [source, 0]; // read feedback, add to source

            local = DelayN.ar(local, 0.2, 0.2); // delay sound

            // reverse channels to give ping pong effect, apply decay factor
            LocalOut.ar(local.reverse * 0.8);

            Out.ar(0, local);
    }.play;
#+END_SRC
